Мюнцкабинент_30/src/InformationRegisters/ПочтовыеТреки/ПочтовыеТреки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеТреки</name>
  <comment>Прохождение почтовых отправлений</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Индекс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПочтовоеОтделение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Операция</name>
    <type>
      <types>CatalogRef.ПочтовыеОперации</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.ПочтовыеСтатусы</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DefinedType.ОтслеживаемыеПочтовыеОтправления</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/ПочтовыеТреки/ManagerModule.bsl
Процедура ОбновитьИнформациюПоТреку (ПочтовоеОтправление, ТочкиМаршрута) Экспорт
	
	Если ТипЗнч (ТочкиМаршрута) = Тип("Массив") И ТочкиМаршрута.Количество () <= 0 Тогда
		Возврат
	КонецЕсли;	
	
	НЗ = РегистрыСведений.ПочтовыеТреки.СоздатьНаборЗаписей();
	НЗ.Отбор.Документ.Установить (ПочтовоеОтправление);
	НЗ.Прочитать();
	НЗ.Очистить();
	//
	ПредыдущийПериод = Дата (1,1,1);
	//
	Для Каждого Точка ИЗ ТочкиМаршрута Цикл
		
		НоваяЗапись						= НЗ.Добавить();
		
		Если ПредыдущийПериод = Дата (1,1,1) Тогда
			ПредыдущийПериод 			= Точка.Дата
		ИначеЕсли ПредыдущийПериод = Точка.Дата Тогда
			Точка.Дата 					= Точка.Дата + 1;
		КонецЕсли;	
		
		НоваяЗапись.Период				= Точка.Дата;
		НоваяЗапись.Документ 			= ПочтовоеОтправление;
		НоваяЗапись.Индекс				= Точка.Индекс;
		НоваяЗапись.ПочтовоеОтделение	= Точка.Описание;
		Если Точка.Свойство ("Операция") Тогда
			НоваяЗапись.Операция		= Точка.Операция;
		КонецЕсли;	
		Если Точка.Свойство ("Статус") Тогда
			НоваяЗапись.Статус			= Точка.Статус;
		КонецЕсли;
	КонецЦикла;	
	
	Попытка
		НЗ.Записать ();
	Исключение
		Инфо = ИнформацияОбОшибке();
		ПодробнаяИнформацияОбОшибке = ПодробноеПредставлениеОшибки(Инфо); 
		ЗаписьЖурналаРегистрации("ОтслеживаниеПочтовыхОтправлений", УровеньЖурналаРегистрации.Ошибка, , , ПодробнаяИнформацияОбОшибке)
	КонецПопытки;	
	
КонецПроцедуры
